import React, { useEffect, useRef, useState } from "react";
import styles from "./view.module.css";
import router, { useRouter } from "next/router";
import { useReactToPrint } from "react-to-print";
import { Button, Card, Grid } from "@mui/material";
import urls from "../../../../URLS/urls";
import axios from "axios";
import moment from "moment";
import { useGetToken } from "../../../../containers/reuseableComponents/CustomHooks";

const Index = () => {
  const componentRef = useRef(null);
  const router = useRouter();
  const userToken = useGetToken();

  const [data, setData] = useState(null);
  const handlePrint = useReactToPrint({
    content: () => componentRef.current,
    documentTitle: "new document",
  });

  useEffect(() => {
    console.log("router.query", router.query);
    if (router.query.id && router.query.serviceId) {
      axios
        .get(
          `${urls.FbsURL}/transaction/provisionalBuildingFireNOC/getById?appId=${router.query.id}`,
          {
            headers: {
              Authorization: `Bearer ${userToken}`,
            },
          }
        )
        .then((r) => {
          console.log("r.data", r.data);
          setData(r.data);
        });
    }
  }, []);

  return (
    <>
      <div>
        <ComponentToPrint data={data} ref={componentRef} />
      </div>

      {/* Button for Print and Exit */}
      <div className={styles.btn}>
        <Button variant="contained" type="primary" onClick={handlePrint}>
          print
        </Button>
        <Button
          type="primary"
          variant="contained"
          onClick={() => {
            router.push("/dashboard");
          }}
        >
          Exit
        </Button>
      </div>
    </>
  );
};
class ComponentToPrint extends React.Component {
  render() {
    return (
      <>
        <div className={styles.mainBox}>
          <div className={styles.reportContainer}>
            <div className={styles.header}>
              <div className={styles.one}>
                <img src="/logo.png" alt="" height={150} width={180} />
              </div>

              <div className={styles.second}>
                <div className={styles.pcm}>
                  <b>पिंपरी-चिंचवड महानगरपालिका</b>
                </div>
                <div className={styles.pcmMiddle}>
                  <b>अग्निशमन विभाग</b>
                </div>
                <div className={styles.pcmSecond}>
                  <h4>
                    <b>Pimpri Chinchwad Municipal Corporation</b>
                  </h4>
                </div>
              </div>
              <div className={styles.one}>
                <img
                  src="/rts_servicelogo.png"
                  alt=""
                  height={150}
                  width={180}
                />
              </div>
            </div>

            <div className={styles.footer}>
              <h2>Fire Department</h2>
            </div>

            <div className={styles.reportContent}>
              <div className={styles.sHeadingg}>
                <h3>
                  File No:- <span></span>
                </h3>

                <h3>
                  O.W.No:- Fire/01/5PC/WS/<span></span>/2022
                </h3>

                <h3>
                  Date:- <span>18</span>
                  <span>/06</span>/2022
                </h3>
              </div>
              <div className={styles.footer}>
                <b>
                  <p>
                    ................................................................................................................................................................................................................................................
                  </p>
                </b>
              </div>

              <div
                style={{
                  display: "flex",
                  flexDirection: "column",
                  alignItems: "center",
                }}
              >
                <h2>
                  <u>अग्रिशामक ना हरकत दाखला - (रुग्णालय/वैद्यकीय व्यवसाय)</u>
                </h2>
              </div>

              <div className={styles.sHeadingg}>
                <div>
                  <h3>Token No:-103322230010950</h3>
                </div>

                <div>
                  <h3>Token Dt:- 26/10/2022</h3>
                </div>
              </div>
              <p></p>
              <p>
                <b>
                  मे. लोकमान्य हॉस्पिटल निगडी, सेक्टर नं. २४, युनिट 11
                  पि.सि.एन.टी.डी.ए., निगडी, पुणे.
                </b>{" "}
                यांनी दिनांक <b>२६/०३/२०२१ आणि ०९/०६/२०२१</b> चे विनंती
                अर्जानुसार वैद्यकीय रुग्णालय) व्यवसाय करणेकामी अग्रिशामक ना हरकत
                दाखल्याची मागणी केली आहे. सदर रुग्णालय इमारतीचे बांधकाम
                प्रयोजनार्थ अग्निशामक दलाकडून सदर रुग्णालय इमारती करिता अंतिम
                अग्निशमन दाखला क्र. Fire/02/5PC/WS/941/2019, Dt.13/02/2019 नुसार
                तळमजला +०३ मजले, उंची: १७.४५ मी. बिल्ट-अप एरिया ३७५७.८३ चौ.मी.
                करीता देणेत आला आहे.
              </p>
              <p>
                सदर वैद्यकीय रुग्णालय) व्यवसाय जागेची तपासणी अग्निशामक दलाचे
                अधिकारी यांनी दि. ०८/०५/२०२१ रोजी समक्ष जावुन तांत्रिक तपासणी
                केली खालील अटींवर ना हरकत दाखला देणेत येत आहे.{" "}
              </p>

              {/* <ol>
                <li>
                  सदर कंपनी उद्योगधंदा जागेचे एकुण बांधकाम ५०३८५.१३ चौ.मी. आहे.{" "}
                </li>
                <li>
                  सदरचा ना हरकत दाखला कंपनी उद्योगधंदा व्यवसाय करणे पुरताच
                  मर्यादित राहील.
                </li>
                <li>
                  सदर खालील प्रमाण अग्निशानक उपकरण ठेवली आहेत :<br />{" "}
                  <span
                    style={{
                      marginLeft: "20px",
                    }}
                  >
                    {" "}
                    अ) फायर पंप सिस्टीम, ऑटोमेटीक वॉटर स्प्रिंकलर सिस्टीम, फायर
                    हायडन्ट स्टिीम, ऑटोनेटीक फायर डिटेक्टशन सिस्टीम, फायर आलार्म
                    सिस्टीम एक्सटियुशवसविणेत आले आहे.
                  </span>
                </li>

                <li>
                  अग्निशामक साधने / यंत्रण हाताळण्याचे / वापराचे प्रशिक्षण
                  कर्मचा-यांना देणेत आले आहे.
                </li>
                <li>सदर जागेत धुम्रपान निषेध बोर्ड लावले आहेत.</li>
                <li>
                  सदर जागेत महत्त्वाचे दुरध्वनी क्रमांक ठळक अक्षरात लावलेत.
                  पोलीस, अग्रिशमक दल, ई.
                </li>
                <li>सदर जागेत असलेला पाण्याचा साठा सतत उपलब्ध ठेवणेत यावा.</li>
                <li>
                  {" "}
                  सदर जागेत मनपा तसेच Statutory Bodies चे पुर्वपरवानगीशिवाय फेर
                  फार / बदल करुन नये.
                </li>
                <li>
                  मनपा ने वेळोवेळी केलेले नियम व उपविधी आपणावर बंधनकारक राहतील.
                </li>
                <li>वरील सर्व अटींची पुर्तता केली आहे. (क्र. १ ते ७ पर्यंत)</li>
                <li>
                  {" "}
                  सदर ना हरकत दाखल्याची मुदत दिनांक ३१/०३/२०२२ रोजी पयंत राहील,{" "}
                </li>
                <li>
                  {" "}
                  सदरचा ना हरकत दाखला केवळ अग्निप्रतिबंधात्मक व सुरक्षिततेच्या
                  दृष्टिने देणेत येत आहे. सदर व्यवसायासाठी, पिंपरी चिंचवड मनपाचे
                  इतर खात्यांची, शासकिय, निमशासकिय खात्यांची परवानगी
                  आवश्यकतेनुसार घेण्यात यावी.
                </li>
                <li>
                  महाराष्ट्र महानगरपालिका अधिनियम, १९४९ चे कलम ३८६(३) नुसार ज्या
                  माहिती व आपण सादर केलेल्या कागदपत्रांच्या आधारे उक्त ना हरकत
                  दाखला दिला आहे. ती माहिती अथवा कागदपत्रे विपर्यास अथवा उक्त
                  अटी/शर्तीचे उल्लंघन झाल्यास/केल्यास आपण कारवाईस पात्र रहाल.
                  सदर दाखला त्याचवेळेस रद्द समजणेत येईल.
                </li>
                <li>
                  {" "}
                  अर्जदार यांनी त्यांच्याकडील लावणेत आलेली अग्निक्षमन यंत्रणा
                  सुस्थितीत व वापरणे योग्य असल्याबाबत अधिकृत फायर लायसन्स धारक
                  यांचेकडील विहित नमुन्यातील "बी फॉर्म', दरवर्षी माहे जानेवारी व
                  माहे जुलै मध्ये अग्निशामक विभागाच्या कार्यालयात सादर करणे
                  आवश्यक आहे.
                </li>
              </ol> */}

              <table>
                <tr>
                  <td>1.</td>
                  <td>
                    सदरचा ना हरकत दाखला वैद्यकीय (रुग्णालय- १०० बेड क्षमता)
                    व्यवसाय करणे पुरताच मर्यादित राहील.{" "}
                  </td>
                </tr>
                <tr>
                  <td>2.</td>
                  <td>
                    सदर खालील प्रमाणे अग्निशामक उपकरणे ठेवली आहेत. फायर बुस्टर
                    पंप, ऑटोमेटिक वॉटर स्प्रिंकलर सिस्टीम, फायर हायड्रन्ट
                    सिस्टीम, होजरील होज सिस्टीम, स्मोक/हिट डिटेक्टशन सिस्टीम,
                    फायर आलार्म सिस्टीम, फायर एटिंग्युशर्स बसविणेत आले आहेत.{" "}
                  </td>
                </tr>
                <tr>
                  <td>3.</td>
                  <td>
                    अग्निशामक साधने / यंत्रणा हाताळण्याचे / वापराचे प्रशिक्षण
                    कर्मचा-यांना देणेत आले आहे.
                  </td>
                </tr>
                <tr>
                  <td>4.</td>
                  <td>सदर जागेत धुम्रपान निषेध बोर्ड लावले आहेत </td>
                </tr>
                <tr>
                  <td>5.</td>
                  <td>
                    सदर जागेत महत्त्वाचे दुरध्वनी क्रमांक ठळक अक्षरात लावलेत,
                    पोलीस, अग्रिशामक दल, ई.{" "}
                  </td>
                </tr>
                <tr>
                  <td>6.</td>
                  <td>सदर जागेत असलेला पाण्याचा साठा सतत उपलब्ध ठेवला आहे. </td>
                </tr>
                <tr>
                  <td>7.</td>
                  <td>
                    सदर जागेत मनपा तसेच Statutory Bodies चे पुर्वपरवानगीशिवाय
                    फेर फार / बदल करुन नये.{" "}
                  </td>
                </tr>
                <tr>
                  <td>8.</td>
                  <td>
                    मनपा ने वेळोवेळी केलेले नियम व उपविधी आपणावर बंधनकारक
                    राहतील.{" "}
                  </td>
                </tr>
                <tr>
                  <td>9.</td>
                  <td>
                    सदर ना हरकत दाखल्याचे दरवर्षी ३१ मार्च पुर्वी नुतनीकरण करुन
                    घेणे बंधनकारक राहील.{" "}
                  </td>
                </tr>
                <tr>
                  <td>10.</td>
                  <td>
                    सदर ना हरकत दाखल्याची मुदत दिनांक ३१/०३/२०२२ (एक वर्ष)
                    पर्यंत राहील.{" "}
                  </td>
                </tr>
                <tr>
                  <td>11.</td>
                  <td>
                    वरील सर्व अटींची पुर्तता केली आहे. (क्र. १ ते ६ पर्यंत){" "}
                  </td>
                </tr>
                <tr>
                  <td>12.</td>
                  <td>
                    ना हरकत दाखला केवळ अग्रिप्रतिबंधात्मक दृष्टिने देणेत येत
                    आहे. सदर व्यवसायासाठी, पिंपरी चिंचवड मनपाचे इतर खात्यांची,
                    शासकिय, निमशासकिय खात्यांची परवानगी आवश्यकतेनुसार घेण्यात
                    यावी.{" "}
                  </td>
                </tr>
                <tr>
                  <td>13.</td>
                  <td>
                    सदर उद्योगधंदा / व्यवसायाचे ठिकाणी लावण्यात आलेल्या अग्निशमन
                    यंत्रणेचा ती सुस्थितीत व कार्यरत असले बाबत प्रत्येक जानेवरी
                    व जुलै या सहा महिन्याचा 'B-फॉर्म' अग्रिशमन कार्यालयात जमा
                    करणेत यावा.{" "}
                  </td>
                </tr>
                <tr>
                  <td>14.</td>
                  <td>
                    (महाराष्ट्र महानगरपालिका अधिनियम, १९४९ चे कलम ३८६(३) नुसार)
                    ज्या माहिती व आपण सादर केलेल्या कागदपत्रांच्या १४. आधारे
                    उक्त ना हरकत दाखला दिला आहे. ती माहिती अथवा कागदपत्रे
                    विपर्यास अथवा उक्तअटी/शर्तीचे उल्लंघन झाल्यास/ केल्यास आपण
                    कारवाईस पात्र रहाल. सदर दाखला त्याच वेळेस रद्द समजणेत येईल.{" "}
                  </td>
                </tr>
                <tr>
                  <td>15.</td>
                  <td>
                    सदर रुग्णालय/वैद्यकीय व्यवसाय अग्नि. ना. हरकत दाखल्याच्या
                    मागील बाजूस देणेत आलेल्या प्रपत्र 'अ' मध्ये नमूद १५. अटींची
                    पूर्तता पुढील ०६ महिन्याच्या कालावधीत करणेच्या अटीस अधीन
                    राहून अग्नि. ना. हरकत दाखला देणेत येत आहे.
                  </td>
                </tr>
              </table>

              <br />
              <br />
              <div>
                <div className={styles.mFooter}>
                  <p>
                    {" "}
                    <div className={styles.footer}>
                      <b>मुख्य अग्निशमन अधिकारी </b>
                    </div>
                    <div className={styles.footer}>
                      <b>पिंपरी चिंचवड महानगरपालिका, पिंपरी-१८</b>{" "}
                    </div>
                  </p>
                </div>
              </div>
              <br />

              <div>
                <div className={styles.lFooter}>
                  <p>
                    {" "}
                    <div>
                      <b> प्रति, </b>
                    </div>
                    <div>
                      <b> मे. लोकमान्य हॉस्पिटल निगडी,</b>{" "}
                    </div>
                    <div className={styles.footer}>
                      <b>
                        {" "}
                        सेक्टर नं. २४, युनिट -11, पि.सि.एन.टी.डी.ए., निगडी,
                        पुणे.
                      </b>{" "}
                    </div>
                  </p>
                </div>
              </div>

              <div>
                <p>
                  <b>
                    (अग्नि सेवा शुल्क र.रु १,५००/- पा. क्र. ३०८०२०२१०००५८७४,
                    दिनांक २६/०३/२०२१ नुसार स्विकारलेत आणि शिल्लक रक्कम रु.
                    ३८,३००/- पा.क्र. ३०८०२१२२००००५०५, दिनांक ०३/०८/२०२१ नुसार
                    स्विकारलेत.)
                  </b>
                </p>
              </div>
            </div>
          </div>
        </div>
      </>
    );
  }
}

export default Index;
