import CheckIcon from "@mui/icons-material/Check";
import ClearIcon from "@mui/icons-material/Clear";
import { Button, Paper } from "@mui/material";
import { useRouter } from "next/router";
import React from "react";
import FormattedLabel from "../../../../../containers/reuseableComponents/FormattedLabel";
import styles from "../../../../../styles/marrigeRegistration/[newMarriageRegistration]view.module.css";
const Index = () => {
  const router = useRouter();
  return (
    <>
      <Paper
        sx={{
          marginLeft: 2,
          marginRight: 2,

          marginBottom: 2,
          padding: 1,
          border: 1,
          borderColor: "grey.500",
        }}
      >
        <div className={styles.small}>
          <div
            style={{
              backgroundColor: "#3EADCF",
            }}
          >
            <h2
              style={{
                // marginLeft: "350px",
                // marginTop: "25px",
                display: "flex",
                justifyContent: "space-around",
                color: "yellow",
              }}
            >
              <b>पिंपरी चिंचवड महानगरपालिका,पिंपरी-४११०१८</b>
            </h2>
            <h3
              style={{
                display: "flex",
                justifyContent: "space-around",
                color: "yellow",
              }}
            >
              <b>महाराष्ट्र विवाह अधिनियम , १९९८</b>
            </h3>
          </div>

          <h3
            style={{
              display: "flex",
              justifyContent: "space-around",
              color: "red",
            }}
          >
            <b>विवाह नोंदणी करण्याची कार्यपद्धती व आवश्यक कागदपत्र</b>
          </h3>
          {/* term */}

          <div
            style={{
              marginLeft: "70px",
              marginTop: "25px",
              marginRight: "25px",
            }}
          >
            <h4>
              १) वधु किंवा वर या पैकी एकजण पिंपरी चिंचवड महानगरपालिका हद्दीतील
              रहिवासी असावा व विवाह महाराष्ट्र राज्यामध्ये झालेला असणे आवश्यक
              आहे.महाराष्ट्र राज्याचे बाहेरील झालेले विवाहाची नोंदणी या
              कार्यालयात होत नाही.
            </h4>
            {/* <h4>
              2) विवाह नोंदणी फोर्म नजीकच्या नागरी सुविधाकेंद्रावरून घेणे
              फोर्मवर, वर + वधु + साक्षीदारांचे पासपोर्ट साईजचे फोटो
              चिकटवावे.फोर्मच्या पान क्रमांक ४ वर रुपये 100/- किंमतीचे कोर्ट फी
              स्टैम्प लेबल <br />
              चिकटवावे.
            </h4> */}
            <h4
              style={{
                marginTop: "10px",
                marginRight: "25px",
              }}
            >
              २) फॉर्म सोबत वर + वधु यांच्या जन्म तारखेचा पुरावा म्हणुन शाळा
              सोडल्याचा दाखला / दहावी/बारवीचे प्रमाणपत्र / वाहनपरवाना /
              पासपोर्ट/ पॅनकार्ड / इत्यादी पैकी एक नोटराईज्ड प्रमाणित केलेले
              झेरॉक्स प्रत जोडावी.
            </h4>
            <h4
              style={{
                marginTop: "10px",
                marginRight: "25px",
              }}
            >
              ३) वर + वधु पत्याचे पुरावे म्हणून रेशनकार्ड/पासपोर्ट / निवडणुक
              ओळखपत्र / शासकीय कार्यालयांचे ओळखपत्र / संबंधितांच्या नावाचा
              उल्लेख असणारे वीजबील / बी.एस.एन.एल. टेलीफोन बील / आधार कार्ड /
              नोंदणीकृत भाडे करार / वाहनपरवाना यापैकी एक झेरॉक्स प्रत जोडावी.
              वरील सर्व झेरॉक्स प्रती साक्षांकित / नोटराईज्ड सत्यप्रती असणे
              आवश्यक आहे.
            </h4>
            <h4
              style={{
                marginTop: "10px",
              }}
            >
              ४) वर+ वधु यांचे ओळखीचे पुरवा म्हणून आधारकार्ड / पॅनकार्ड /
              वाहनपरवाना / निवडणुक ओळखपत्र यापैकी एक पुरावा आवश्यक आहे.
            </h4>
            <h4
              style={{
                marginTop: "10px",
              }}
            >
              ५) वर + वधु यांचे वरील प्रमाणे १) ओळखीचा पुरावा २) पत्याचा पुरावा
              ३) जन्मतारखेचा पुरावा असे तीन वेगवेगळे पुरावे देणे आवश्यक आहे.
            </h4>
            <h4
              style={{
                marginTop: "10px",
              }}
            >
              ६)विवाह नोंदणी करीता ३ साक्षीदार असणे आवश्यक आहे. साक्षीदारांचे
              ओळखीचा पुरावा म्हणुन पासपोर्ट/आधारकार्ड/ वाहनपरवाना / निवडणुक
              ओळखपत्र / यापैकी एक पुरावा असणे आवश्यक आहे.
            </h4>
            {/* <h4
              style={{
                marginTop: '10px',
              }}
            >
              7)फार्ममध्ये कॉलम क्र. ७ मध्ये पुरोहित - भटजी यांचे माहिती व
              स्वाक्षरी दिनांकात असावी.
            </h4> */}
            <h4
              style={{
                marginTop: "10px",
              }}
            >
              ७)मुस्लीम व्यक्तींचा विवाह मुस्लीम कायद्यान्वये झाला असल्यास
              निकाहनाम्याची साक्षांकित प्रत जोडावी. निकाहनामा जर उर्दू भाषेत
              असेल, तर त्यांचे इंग्रजी किंवा मराठी भाषांतर करुन त्यातर संबंधीत
              काझी यांची स्वाक्षरी घेऊन प्रत सोबत जोडावी.
            </h4>
            <h4
              style={{
                marginTop: "10px",
              }}
            >
              ८)पुर्ण भरलेला फॉर्म हा वधु / वर साक्षीदार यापैकी एक व्यक्तीने
              सकाळी १० ते १.३० या वेळेत दाखल केल्यास फॉर्म तपासुन टोकन क्रमांक व
              दिनांक वेळ सांगितली जाईल. त्यावेळी वर/वधु +३ साक्षीदार यांनी समक्ष
              हजर व्हावे त्याचदिवशी विवाह नोंदणी पुर्ण करून प्रमाणपत्र दिले
              जाईल.
            </h4>
            <h4
              style={{
                marginTop: "10px",
              }}
            >
              ९) मूळ लग्नपत्रिका
            </h4>
            <h4
              style={{
                marginTop: "10px",
              }}
            >
              १०) वर, वधु घटस्फोटित असल्यास कोर्टाच्या हुकुमनाम्याची नोटराईज्ड
              सत्यप्रत जोडणे आवश्यक आहे.
            </h4>
            <h4
              style={{
                marginTop: "10px",
              }}
            >
              ११) लग्नपत्रिका नसल्यास शासनाने दिलेल्या विहित नमुन्यातील
              प्रतिज्ञापत्र रु.१००/- चे स्टॅम्प पेपरवर सादर करणे आवश्यक आहे.
              तसेच लग्नविधी प्रसंगीचा एक फोटो जोडणे आवश्यक आहे.
            </h4>
            <h4
              style={{
                marginTop: "10px",
              }}
            >
              १२) वर-वधु प्रत्येकी १ फोटो (पासपोर्ट साईज )
            </h4>
            <h4
              style={{
                marginTop: "10px",
              }}
            >
              १३) साक्षीदार प्रत्येक १ फोटो (पासपोर्ट साईज )
            </h4>
            <h4
              style={{
                marginTop: "10px",
              }}
            >
              १४) सर्व मूळ कागदपत्रे विवाह नोंदणी करतेवेळी आणणे.
            </h4>
            <h4
              style={{
                marginTop: "10px",
              }}
            >
              १५) वधु-वर पैकी विधवा / विधुर असल्यास मयत पती किंवा पत्नीचा
              म्रुत्यु दाखला. अर्जसोवत नोटराईज्ड सत्यप्रत जोडणे आवश्यक आहे.
            </h4>
            <h4
              style={{
                marginTop: "10px",
              }}
            >
              १६) सदरचा फॉर्म नागरि सुविधा केंद्रामार्फत भरल्यास रु. २० ची पावती
              जोडुन या कार्यालयाकडे सादर करावा.तसेच विवाह नोंदणी फी. नोंदणी वेळी
              समक्ष भरावी लागेल.
            </h4>
            <h4
              style={{
                marginTop: "10px",
              }}
            >
              १७) विवाह नोंदणी अर्ज एजंट / नातेवाईक यांचे मार्फत स्विकारले जाणार
              नाहीत.
            </h4>
            {/* <h4
              style={{
                marginTop: "10px",
              }}
            >
              18) विवाह नोंदणी करण्याची कार्यपद्धती व आवश्यक कागदपत्रे यांच्या
              सुचना अर्ज आँनलाईन करण्यापुर्वी दिलेल्या आहेत, तसेच कागदपत्रांची
              यादी यांचीसुध्दा माहीती जोडलेली आहे त्यानुसार सर्व कागदपत्रे
              अर्जासोबत लावून नोटरी करावी व अर्ज नागरी सुविधा केंद्रामध्ये जावून
              रक्कम रु 20.00 पावती करुन जमा करावा.
            </h4>
            <h4
              style={{
                marginTop: "10px",
              }}
            >
              19) ज्यांचा विवाह महाराष्ट्र राज्यामध्ये झालेला आहे, त्यांचीच
              नोंदणी या कार्यालयात होईल.
            </h4> */}
            <h4
              style={{
                marginTop: "10px",
              }}
            >
              {/* 20) नागरिक सुविधा केंद्राद्वारे अर्ज भरण्यासाठी रु.20 शुल्क आकारले
              जाईल आणि ऑनलाइन पद्धतीने अर्ज भरण्यासाठी कोणतेही शुल्क आकारले
              जाणार नाही. */}
              १८) अर्जदाराने स्वतः ऑनलाइन पद्धतीने अर्ज भरल्यास नागरी सुविधा
              केंद्राची पावतीची आवश्यकता नाही.
            </h4>
          </div>

          <div
            className={styles.AcceptBtn}
            style={{
              marginRight: "20px",
            }}
          >
            <Button
              variant="contained"
              color="success"
              endIcon={<CheckIcon />}
              onClick={() => {
                router.push({
                  pathname: `/marriageRegistration/transactions/newMarriageRegistration/citizen/newRegistration`,
                  query: {
                    pageMode: "Add",
                  },
                });
              }}
              // disabled={state}
            >
              <FormattedLabel id="Tnc" />
            </Button>
            <div style={{ marginLeft: "5vh" }}>
              <Button
                variant="contained"
                color="error"
                endIcon={<ClearIcon />}
                onClick={() => {
                  router.push({
                    pathname: `/dashboard`,
                    query: {
                      pageMode: "Add",
                    },
                  });
                }}
              >
                <FormattedLabel id="exit" />
              </Button>
            </div>
          </div>
        </div>
        <div className={styles.row}></div>
      </Paper>
    </>
  );
};

export default Index;
